Revit 2026 API

# SpecUtils Class

---

A utility class of functions related to specs. A spec describes a data type that parameters can hold.

SystemObject Autodesk.Revit.DBSpecUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SpecUtils
```
```vb
Public NotInheritable Class SpecUtils
```
```cpp
public ref class SpecUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SpecUtils = class end
```

The SpecUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAllSpecs | Gets the identifiers of all specs. |
|  | IsSpec | Checks whether a ForgeTypeId identifies a spec. |
|  | IsValidDataType | Returns true if the given ForgeTypeId identifies a valid parameter data type. |

#### Reference

Autodesk.Revit.DB Namespace